src/cf/InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияПоследнейМеткиВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПодписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодписиКриптографии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторРучнойПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАтрибутыПровереныВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаМатематическойПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриАвтоматическомПродлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПроверкиДополнительныхАтрибутов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМатематическиВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропуститьПриПродлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьУникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОбъект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьУстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЭлектронныеПодписи/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДоступнаУсовершенствованнаяЭП = ЭлектроннаяПодпись.ДоступнаУсовершенствованнаяПодпись();
	
	Элементы.ТипПодписи.Видимость = ДоступнаУсовершенствованнаяЭП;
	Элементы.СрокДействияПоследнейМеткиВремени.Видимость = ДоступнаУсовершенствованнаяЭП;
	Элементы.ФормаПродлитьСрокДействия.Видимость = ДоступнаУсовершенствованнаяЭП;
	
	ЗаполнитьПоЗаписи();
	
	ЕстьПравоНаУстановкуДоверенности = РаботаСЭП.ДоступноУказаниеДоверенностиПодписи(Запись.ИдентификаторПодписи);
	ДоверенностьНеобходима = Ложь;
	Сертификат = ПолучитьИзВременногоХранилища(АдресСертификата);
	Если ТипЗнч(Сертификат) = Тип("ДвоичныеДанные") Тогда
		СертификатКриптографии = Новый СертификатКриптографии(Сертификат);
		Если ТипЗнч(СертификатКриптографии) = Тип("СертификатКриптографии") Тогда
			ДоверенностьНеобходима = РаботаСЭП.СертификатуНужнаДоверенность(СертификатКриптографии);
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПравоНаУстановкуДоверенности И ДоверенностьНеобходима Тогда
		Элементы.ФормаУстановитьДоверенность.Видимость = Истина;
	Иначе
		Элементы.ФормаУстановитьДоверенность.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СертификатНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		Возврат;
	КонецЕсли;
	
	МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	
	Если Не ЗначениеЗаполнено(АдресСертификата) Тогда
		МодульЭлектроннаяПодписьКлиент.ОткрытьСертификат(Запись.Отпечаток, Истина);
	Иначе
		МодульЭлектроннаяПодписьКлиент.ОткрытьСертификат(АдресСертификата, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДоверенностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Доверенность" Тогда
		ПоказатьЗначение(, Доверенность);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Доверитель" Тогда
		ПоказатьЗначение(, ДоверительСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ЭлектроннаяПодписьКлиент.СохранитьПодпись(АдресПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьСрокДействия(Команда)
	
	ОбработчикПродолжения = Новый ОписаниеОповещения("ОбработатьПродлениеПодписей", ЭтотОбъект);
	
	РаботаСЭПКлиент.ПродлитьДействиеПодписей(ЭтотОбъект,
		Запись.ИдентификаторПодписи, ОбработчикПродолжения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоверенность(Команда)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ОбработатьУказаниеДоверенности", ЭтотОбъект);
	
	РаботаСЭПКлиент.УказатьДоверенностьЭлектроннойПодписи(Запись.ИдентификаторПодписи, ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьПродлениеПодписей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Успех <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЗаписи();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаписи()
	
	МенеджерЗаписи = Неопределено;
	
	Если Не Параметры.Ключ.Пустой()Тогда
		
		МенеджерЗаписи = РаботаСЭП.ПолучитьЭлектроннуюПодпись(Запись.ПодписанныйОбъект, Запись.УстановившийПодпись,
			Запись.ДатаПодписи, Запись.ИдентификаторПодписи);
		
	ИначеЕсли Параметры.Свойство("ДатаПодписи") И Параметры.Свойство("Объект") 
		И Параметры.Свойство("УстановившийПодпись") И Параметры.Свойство("УникальныйИдентификатор")
		И ТипЗнч(Параметры.УстановившийПодпись) = Тип("СправочникСсылка.Пользователи") Тогда
		
		МенеджерЗаписи = РаботаСЭП.ПолучитьЭлектроннуюПодпись(Параметры.Объект, Параметры.УстановившийПодпись,
			Параметры.ДатаПодписи, Параметры.УникальныйИдентификатор);
		
	ИначеЕсли Параметры.Свойство("УникальныйИдентификатор") Тогда
		
		МенеджерЗаписи = МенеджерЗаписиПоИдентификаторуПодписи(Параметры.УникальныйИдентификатор);
		
	ИначеЕсли Параметры.Свойство("ИдентификаторПодписи") Тогда
		
		МенеджерЗаписи = МенеджерЗаписиПоИдентификаторуПодписи(Параметры.ИдентификаторПодписи);
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ПодписанныйОбъект) И ЗначениеЗаполнено(Запись.ИдентификаторПодписи) Тогда
		
		МенеджерЗаписи = РаботаСЭП.ПолучитьЭлектроннуюПодпись(Запись.ПодписанныйОбъект, Запись.УстановившийПодпись,
			Запись.ДатаПодписи, Запись.ИдентификаторПодписи);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не хватает параметров для открытия формы просмотра ЭП.'");
		
	КонецЕсли;
	
	Если МенеджерЗаписи = Неопределено Тогда
		ВызватьИсключение("Электронная подпись не найдена");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	Если Не ЗначениеЗаполнено(Запись.Комментарий) Тогда
		Запись.Комментарий = НСтр("ru = 'Не указан'");
		Элементы.Комментарий.ЦветТекста = ЦветаСтиля.НедоступныеДанныеЦвет;
	КонецЕсли;
	
	Если ТипЗнч(Запись.ПодписанныйОбъект) = Тип("СправочникСсылка.ВерсииФайлов") Тогда
		ПодписанныйОбъект = Запись.ПодписанныйОбъект.Владелец;
	Иначе
		ПодписанныйОбъект = Запись.ПодписанныйОбъект;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресПодписи") Тогда
		АдресПодписи = Параметры.АдресПодписи;
	Иначе
		ДвоичныеДанные = МенеджерЗаписи.Подпись.Получить();
		Если ДвоичныеДанные <> Неопределено Тогда 
			АдресПодписи = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресСертификата") Тогда
		АдресСертификата = Параметры.АдресСертификата;
	Иначе
		ДвоичныеДанные = МенеджерЗаписи.Сертификат.Получить();
		Если ДвоичныеДанные <> Неопределено Тогда 
			АдресСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступнаУсовершенствованнаяЭП Тогда
		
		Если ЗначениеЗаполнено(Запись.ТипПодписи) Тогда
			Элементы.ТипПодписи.Видимость = Истина;
		Иначе
			Элементы.ТипПодписи.Видимость = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.СрокДействияПоследнейМеткиВремени) Тогда
			Элементы.СрокДействияПоследнейМеткиВремени.Видимость = Истина;
		Иначе
			Элементы.СрокДействияПоследнейМеткиВремени.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	СтандартныеПодсистемыСервер.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
	НастроитьФормуПоДоверенности();
	НастроитьФормуПоРезультатамПроверки(МенеджерЗаписи.Сертификат);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоРезультатамПроверки(Сертификат)
	
	ДанныеДляСтатуса = РаботаСЭПКлиентСервер.НовыеДанныеДляПолученияСтатусаПодписи();
	ДанныеДляСтатуса.ПодписьВерна = Запись.ПодписьВерна;
	ДанныеДляСтатуса.ТекстОшибкиПроверкиПодписи = Запись.ТекстОшибкиПроверкиПодписи;
	
	ДанныеДляСтатуса.СертификатДействителен = Запись.СертификатДействителен;
	ДанныеДляСтатуса.ТекстОшибкиПроверкиСертификата = Запись.ТекстОшибкиПроверкиСертификата;
	
	Если ЗначениеЗаполнено(Доверенность) Тогда
		ДанныеДляСтатуса.ПодписьПоДоверенности = Истина;
		ДанныеДляСтатуса.ДоверенностьДействительна = ДоверенностьДействительна;
		ДанныеДляСтатуса.ПротоколПроверкиДоверенности = ПротоколПроверкиДоверенности;
	Иначе
		ДанныеДляСтатуса.ПодписьПоДоверенности = Ложь;
	КонецЕсли;
	
	ДанныеДляСтатуса.ДатаПроверки = Запись.ДатаПроверкиПодписи;
	ДанныеДляСтатуса.СрокПроверкиСертификата = РаботаСЭП.СрокПроверкиДействияСертификата(
		Сертификат.Получить(), Запись.СрокДействияПоследнейМеткиВремени);
	
	ОбщийСтатусПроверки = РаботаСЭПКлиентСервер.ОбщийСтатусПроверкиПодписи(ДанныеДляСтатуса);
	
	ОбщийСтатусПроверкиКартинка = 1;
	ОписаниеОшибокПроверки = "";
	ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	
	Если Не Запись.ПодписьВерна Тогда
		
		ОбщийСтатусПроверкиКартинка = 3;
		ОписаниеОшибокПроверки = РаботаСЭПКлиентСервер.СтатусПроверкиПодписи(ДанныеДляСтатуса);
		ЦветФона = ЦветаСтиля.ФонПодписьНеверна;
		
	ИначеЕсли Не Запись.СертификатДействителен Тогда
		
		ОбщийСтатусПроверкиКартинка = 2;
		ОписаниеОшибокПроверки = РаботаСЭПКлиентСервер.СтатусПроверкиСертификата(ДанныеДляСтатуса);
		ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
		
	ИначеЕсли ЗначениеЗаполнено(Доверенность) Тогда
		
		Если ДоверенностьДействительна Тогда
			ОбщийСтатусПроверкиКартинка = 2;
			ЦветФона = ЦветаСтиля.ФонПодписьВерна;
		Иначе
			ОписаниеОшибокПроверки = РаботаСЭПКлиентСервер.СтатусПроверкиДоверенности(ДанныеДляСтатуса);
			ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
		КонецЕсли;
		
	Иначе
		
		ОбщийСтатусПроверкиКартинка = 2;
		ЦветФона = ЦветаСтиля.ФонПодписьВерна;
		
	КонецЕсли;
	
	Если ОписаниеОшибокПроверки = "" Тогда
		Элементы.ОписаниеОшибокПроверки.Видимость = Ложь;
	Иначе
		Элементы.ОписаниеОшибокПроверки.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаОсновная.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоДоверенности()
	
	Элементы.НадписьДоверенность.Видимость = Ложь;
	Доверенность = Неопределено;
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Запись.ИдентификаторПодписи);
	ДанныеДоверенностей = РаботаСЭП.ДанныеДоверенностейПодписей(Идентификаторы);
	ДанныеДоверенности = ДанныеДоверенностей[Запись.ИдентификаторПодписи];
	Если ДанныеДоверенности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Доверенность = ДанныеДоверенности.Доверенность;
	ПротоколПроверкиДоверенности = ДанныеДоверенности.ПротоколПроверкиДоверенности;
	ДоверенностьДействительна = ДанныеДоверенности.ДоверенностьВерна;
	
	Если Не ЗначениеЗаполнено(Доверенность) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоверенности = СтрШаблон("<a href=""%1"">%2</a>",
		"Доверенность", Доверенность);
	
	ДанныеДоверителейДоверенностей = РаботаСМЧДДокументооборот.ДанныеДоверителейМЧД(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Доверенность));
	ДоверителиДоверенности = ДанныеДоверителейДоверенностей[Доверенность];
	
	Если ДоверителиДоверенности.Количество() = 0 Тогда
		
		ДоверительСсылка = Неопределено;
		ПояснениеДоверенности = СтрШаблон(НСтр("ru = 'Подписано по доверенности %1'"),
			СтрокаДоверенности);
		
	ИначеЕсли ДоверителиДоверенности.Количество() = 1 Тогда
		
		ДанныеДоверителя = ДоверителиДоверенности[0];
		
		Если ЗначениеЗаполнено(ДанныеДоверителя.Ссылка) Тогда
			ДоверительСсылка = ДанныеДоверителя.Ссылка;
			СтрокаДоверителя = СтрШаблон("<a href=""%1"">%2</a>",
				"Доверитель", ДанныеДоверителя.Представление);
		Иначе
			ДоверительСсылка = Неопределено;
			СтрокаДоверителя = ДанныеДоверителя.Представление;
		КонецЕсли;
		
		ПояснениеДоверенности = СтрШаблон(НСтр("ru = 'Подписано по доверенности %1 (от имени %2)'"),
			СтрокаДоверенности, СтрокаДоверителя);
		
	Иначе
		
		ДоверительСсылка = Неопределено;
		СтрокаДоверителей =
			РаботаСМЧДДокументооборот.ПредставлениеДоверителейМЧД(ДоверителиДоверенности);
		ПояснениеДоверенности = СтрШаблон(НСтр("ru = 'Подписано по доверенности %1 (от имени %2)'"),
			СтрокаДоверенности, СтрокаДоверителей);
		
	КонецЕсли;
	
	Элементы.НадписьДоверенность.Видимость = Истина;
	Элементы.НадписьДоверенность.Заголовок =
		ИнтернетПоддержкаПользователейВызовСервера.ФорматированнаяСтрокаИзHTML(ПояснениеДоверенности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУказаниеДоверенности(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЗаписи();
	
КонецПроцедуры

&НаСервере
Функция МенеджерЗаписиПоИдентификаторуПодписи(ИдентификаторПодписи)
	
	ИдентификаторыПодписей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПодписи);
	
	СвойстваПодписей = РаботаСЭП.УстановленныеПодписиПоИдентификаторам(ИдентификаторыПодписей);
	
	СвойстваПодписи = СвойстваПодписей[ИдентификаторПодписи];
	
	Если СвойстваПодписи = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось получить электронную подпись по уникальному идентификатору %1'"),
			УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат РаботаСЭП.ПолучитьЭлектроннуюПодпись(
		СвойстваПодписи.ПодписанныйОбъект,
		,
		,
		СвойстваПодписи.ИдентификаторПодписи);
	
КонецФункции

#КонецОбласти
